#Дані про температуру повітря за декаду листопада зберігаються в масиві.
#Визначити, скільки разів температура опускалася нижче -10 градусів.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи
import random
while True:
    b=np.zeros(10,dtype=int)#инициализируем масив нулями ,и присваиваем типу данных тип данных инт
    for i in range(10):#проходимся по елементам масива
      b[i] = random.randint(-20,10)
    print(b)
    count=0
    for k in range(10):#снова проходимся по нашей матрице
       if b[k]<-10: #если елементы меньше -10,счетчик +1
           count+=1
    if count==2 or count==3 or count==4:
      print('Опускалась',count,'раза')
    else:
        print('Опускалась',count,'раз')
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
