#Дані про температуру води на Чорноморському узбережжі за декаду
#вересня зберігаються в масиві. Визначити, скільки за цей час було днів, придатних для
#купання.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи
import random
#Пусть температура для купания будет 18 градусов
while True:
    b=np.zeros(10,dtype=int)#инициализируем масив нулями ,и присваиваем типу данных тип данных инт
    for i in range(10):#проходимся по елементам масива
      b[i] = random.randint(10,25)
    print(b)
    count=0
    for k in range(10):#снова проходимся по нашей масиву
       if b[k]>=18: #если елементы больше или ровно 18,счетчик +1
           count+=1
    print('Дней для купания:',count)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
