#Сформуйте лінійний масив дійсних чисел, елементи якого є відстанями,
#пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи
while True:
    b=np.array(range(1,11))#инициализируем масив нулями,и присваеиваем типу данных тип данных инт
    for k in range(10):#снова проходимся по нашему масиву
      l=b[k]**2*10/2 #ищем расстояние
      print(f'Расстояние за {k+1} сек',l)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
