#Знайти суму всіх елементів масиву цілих чисел що задовольняють умові:
#остача від ділення на 2 дорівнює 3. Розмірність масиву - 20. Заповнення масиву
#здійснити випадковими числами від 200 до 300.
#Павлюк Владислав
import numpy as np
import random
while True:
    b = np.array([random.randint(200,300) for i in range(20)])#Заполняем нашу матрицу 20 рандомными значениями
    s = 0
    print(b)
    for i in range(len(b)): #Наша сумма всегда будет 0,так как элементов с остатком деления на 2 которые равняются 3-не бывает
        if b[i] % 2 == 3:
             s += b[i]
    print("Cумма: ",s)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break


