#Знайти суму всіх елементів масиву цілих чисел, які менше середнього
#арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву
#здійснити випадковими числами від 150 до 300.
#Павлюк Владислав 122-В
import numpy as np#импортируем библиотеку нампи
import random
while True:
    b=np.zeros(20,dtype=int)#инициализируем матрицу масив,и присваеиваем типу данных тип данных инт
    u=[]#пустой список для выходного масива
    count=0
    for i in range(20):#проходимся по елементам масива
      b[i] = random.randint(150,300)#генерируем значения
    print(b)
    srednee=np.mean(b) #ищем среднее арифметическое
    for k in range(20):#снова проходимся по нашему масиву
      l=b[k]#помещаем элементы в пустую переменную
      if l<srednee:
          count+=l
    print('Среднее арифметическое',srednee)
    print('Сумма всех элементов',count)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
