#Знайти добуток елементів лінійного масиву цілих чисел, які кратні 5.
#Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами від 10 до
#100.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи
import random
while True:
    b=np.zeros(10,dtype=int)#инициализируем масив нулями,и присваеиваем типу данных тип данных инт
    count=1
    for i in range(10):#проходимся по елементам масива
      b[i] = random.randint(10,100)#вводим значения
    print(b)
    for k in range(10):#снова проходимся по нашей масива
      l=b[k]#помещаем элементы в пустую переменную
      if l%5==0:
         count*=l#если значения кратные 5 
    if count==1:
        print('Таких чисел нету')
    else:
       print('Произведение чисел кратных 5',count)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
