#27. Лінійний масив містить відомості про кількість опадів, що випали за
#кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
#опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
#місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи
import random
while True:
    b=np.zeros(12,dtype=int)#инициализируем масив нулями,и присваеиваем типу данных тип данных инт
    count=0
    sum=0
    for i in range(12):#проходимся по елементам матрицы
      b[i] = random.randint(10,100)#вводим значения
    print(b)
    minimal=min(b)#Ищем минимальное значение
    for k in range(12):
        sum+=b[k]#ищем общее число осадков
        if b[k]<30:#если элемент меньше 30,месяц засушливый
            count+=1
    print('Общее количество осадков',sum)
    print('Среднемесячное количество осадков',sum/12)
    print('Количество засушливых месяцев',count)
    print('Количество осадков в самый засушливый месяц',minimal)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
