#Змінній t привласнити значення істина, якщо в одновимірному масиві є
#хоча б одне від’ємне і парне число.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи
import random
while True:
    b=np.zeros(10,dtype=int)#инициализируем масив нулями,и присваиваем типу данных тип данных инт
    t=False #присваиваем т значение False
    for i in range(10):#проходимся по елементам масива
      b[i] = random.randint(-10,10)
    print(b)
    for k in range(10):#снова проходимся по нашему масиву
       if b[k]%2==0 and b[k]<0: #если значение отрицательное и парное,т-True
           t=True
    print(t)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
