#Знайти суму додатніх елементів лінійного масиву цілих чисел.
#Розмірність масиву - 10. Заповнення масиву здійснити з клавіатури.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи
while True:
    b=np.zeros(5,dtype=int)#инициализируем масив нулями,и присваиваем типу данных тип данных инт
    suma=0
    for i in range(5):#проходимся по елементам масива
      b[i] = int(input('Введите ваши элементы '))
    print(b)
    for k in range(5):#снова проходимся по нашей матрице
       if b[k]>0:
           suma+=b[k]
    print(suma)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
