#Дані про направлення вітру (північний, південний, східний, західний) і
#силі вітру за декаду листопада зберігаються в масиві. Визначити, скільки днів дув
#південний вітер з силою, що перевищує 8 м / с.
import numpy as np
import random
while True:
    b=np.array([random.randint(0,10) for i in range(41)])#Заполняем масив на 40 значений
    u=[]
    count=0
    for g in range(len(b)):#Добавим элементы нашего масива в список
        u.append(b[g])
    for k in range(len(u)):#Перед каждыми 10 значениями мы вставляем направление ветра
        u[0]='Північний:'
        u[11]='Південний:'
        u[21]='Східний:'
        u[31]='Західний:'
    print(u)
    for o in range(len(u)):
        if 11<o<21 and u[o]>8:#По индексам определяем нужный нам месяц,и считаем элементы больше 8
                count+=1
    print('Количество дней',count)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
