#Створіть масив з п'яти прізвищ і виведіть на екран ті з них, які
#починаються з певної букви, яка вводиться з клавіатури.
#Павлюк Владислав 
import numpy as np#импортируем библиотеку нампи
while True:
    x=input('Введите букву')
    b=np.array([input('Введите фамилию: ') for i in range(5)]) #Заводим масив,и вводиим в масив  5 значений
    for k in b:#Проверка на первую букву,в масиве 
     if k[0]==x:
         print(k)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
