#Підрахувати кількість елементів одновимірного масиву, для яких
#виконується нерівність i*i<ai<i!
#Павлюк Владислав
#Змінній t привласнити значення істина, якщо максимальний елемент
#одновимірного масиву єдиний і не перевищує наперед заданого числа а.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи
import math 
while True:
    b=np.zeros(10,dtype=int)#инициализируем масив нулями,и присваеиваем типу данных тип данных инт
    count=0
    for i in range(10):#проходимся по елементам масива
      b[i] = int(input('Введите значение'))#вводим значения
    print(b)
    for k in range(10):
        if k*k<b[k]<math.factorial(k):#Вводим наше неравенство
            count+=1
    print(count)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
