#Підрахуйте кількість елементів одновимірного масиву, які збігаються зі
#своїм номером і при цьому кратні 3.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи 
import random
while True:
    b=np.zeros(10,dtype=int)#инициализируем масив нулями,и присваеиваем типу данных тип данных инт
    count=0
    for i in range(10):#проходимся по елементам матрицы
      b[i] = random.randint(5,30)#вводим значения
    print(b)
    for k in range(10):
        if b[k]==k and b[k]%3==0: #Если элемент совпадает со своим индексом,и кратный 3,счетчик+=1
            count+=1 
    print(count)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
