#У лотереї розігрувалося 100 квитків. Таблиця містить 10 номерів
#виграшних квитків. Перевірте, чи є квиток з номером N виграшним.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи
import random
while True:
   n=int(input('Введите ваш номер'))
   count=0
   b = np.zeros(10, dtype=int)#инициализируем масив нулями,и укзываем тип даных int
   for i in range(10):#Вводим элементы масива
     b[i] =random.randint(1,100)
   print(b)
   for k in range(10):
     if b[k] == n:#если билет с масива будет совпадать с нашим,счетчик +1
        count += 1
   if count == 1:#если счетчик равен 1,билет выиграшный
     print("Вы победитель")
   else:
      print("Попробуйте еще")
   result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
   if result == '1':
        continue
   else:
        break
