#Дан одновимірний масив а. Сформувати новий масив, який складається
#тільки з тих елементів масиву а, які перевищують свій номер на 10. Якщо таких
#елементів немає, то видати повідомлення.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи
while True:
    b=np.zeros(10,dtype=int)#инициализируем масив нулями,и присваеиваем типу данных тип данных инт
    for i in range(10):#проходимся по елементам масива
      b[i] = int(input('Введите значение'))#вводим значения
    print(b)
    u=[]
    for k in range(10):#Проходимся по значениям масива
        if b[k]>k+10:#Если элемент больше своего номера на 10,добавим его в список
         u.append(b[k])
    if len(u)<1:#Если список пустой,то таких элементов нету
        print("Таких элементов нету")
    else:
        print(u)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
