#В масиві X (1: n) кожен елемент рівний 0, 1 або 5. Переставити елементи
#масиву так, щоб спочатку розташовувалися всі нулі, потім все одиниці, а потім всі
#п'ятірки. Додаткового масиву не заводити.
import numpy as np#импортируем библиотеку нампи
while True:
    b=np.zeros(10,dtype=int)#инициализируем масив нулями,и присваеиваем типу данных тип данных инт
    for i in range(10):#проходимся по елементам матрицы
      b[i] = int(input('Введите значение'))#вводим значения
    while b[i]!=0 and b[i]!=1 and b[i]!=5:#если элементы не будут совпадать с 0,1 или 5 вводим значения снова
      for i in range(10):
          b[i]=int(input('Введите значение 0,1 или 5:'))
    print(b)
    print(sorted(b))#переставляем наши элементы
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
