#Створіть масив А [1..8] за допомогою генератора випадкових чисел з
#елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
#елементів масиву.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи
import random
while True:
    b=np.zeros(8,dtype=int)#инициализируем масив нулями,и присваиваем типу данных тип данных инт
    count=0
    for i in range(8):#проходимся по елементам масива
      b[i] = random.randint(-10,10)
    print(b)
    for k in range(8):#снова проходимся по нашей матрице
       if b[k]<0: #если элементы меньше 0,счетчик увеличивается на 1
           count+=1
    print('Количество отрицательных элементов',count)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
