#Створіть масив А [1..12] за допомогою генератора випадкових чисел з
#елементами від -20 до 10 і виведіть його на екран. Замініть всі від’ємні елементи
#масиву числом 0.
import numpy as np#импортируем библиотеку нампи
import random
while True:
    b=np.zeros(12,dtype=int)#инициализируем масив нулями,и присваиваем типу данных тип данных инт
    for i in range(12):#проходимся по елементам масива
      b[i] = random.randint(-20,10)
    print(b)
    u=[]
    for k in range(12):#снова проходимся по нашей матрице
       if b[k]<0: #если элементы меньше 0,они будут равны 0
           b[k]=0
    print(b)
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
