#З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
#що протягом цього часу температура знижувалася. Визначте, о котрій годині було
#вперше зафіксовано від'ємну температуру.
#Павлюк Владислав
import numpy as np#импортируем библиотеку нампи
import random
while True:
    a=np.array(range(8,21))#Инициализируем масиов,от 8 до 20
    b=np.zeros(len(a),dtype=int)#инициализируем масив нулями ,и присваиваем типу данных тип данных инт
    print(a)
    for i in range(len(a)):#проходимся по елементам матрицы,и вводим значения
      b[i] = random.randint(-20,10)
    print(b)
    u=[]
    for k in range(len(a)):#снова проходимся по нашей матрице
       if b[k]<0: #если цикл находит первый отрицательный элемент,то выводит температуру,индекс числа +8 часов
           print('Темепература снизилась меньше нуля впервые в',k+8,'часов')
           break
    result = input('Хотите продолжить? Если да - 1, Если нет - інше: ')
    if result == '1':
        continue
    else:
        break
